#!/bin/bash




# $0 当前脚本的文件名. 
# $n(n≥1)传递给脚本或函数的参数. n 是一个数字, 表示第几个参数. 例如, 第一个参数是 $1, 第二个参数是 $2. 
# $# 传递给脚本或函数的参数个数. 
# $* 传递给脚本或函数的所有参数. 
# $@ 传递给脚本或函数的所有参数. 当被双引号" "包含时, $@ 与 $* 稍有不同
# $? 上个命令的退出状态, 或函数的返回值
# $$ 当前 Shell 进程 ID. 对于 Shell 脚本, 就是这些脚本所在的进程 ID. 

#$*和$@表示传递给函数或脚本的所有参数, 不被双引号(" ")包含时, 都以"$1" "$2".. #"$n"的形式输出所有参数
#但是当他们被双引号包含时, "$*"会将所有参数作为一个整体, 以"$1 $2 ... $n"的形式
#输出所有参数;"$@"会将各个参数分开, 以"$1" "$2" ... "$n"的形式输出所有参数


# 命令行参数
# my_bash_script -p 2 -l 5 -t 20

pages=  length=  time=

while getopts p:l:t: opt; do
  case $opt in
  p)
      pages=$OPTARG
      ;;
  l)
      length=$OPTARG
      ;;
  t)
      time=$OPTARG
      ;;
  esac
done

shift $((OPTIND - 1))


